from pylab import *
from numpy import *

# sudo apt install python3 python3-pip
# pip(3) install numpy matplotlib pytk

# моделът е y = ax*2 + b и се опитваме да намерим параметрите, но моделът не съответства на точките - линеен е; трябва ми нелинеен модел - в случая - квадратна функция

dsize = 500 # размер на данните (по него се определя точността при изчислението на параметрите на модела) - брой на точките

x = linspace(-1, 1, dsize) # Генерира 500 числа на равни разстояния по абсцисата и ги записва в масив - x-овете
y = x ** 2 + random.normal(size = dsize) / 4 # модел, random.normal(size) / 4 е разпределяща функция, която изчислява вероятността да има число на разстояние от 0 - колкото е по - далеч, толкова е по - малко вероятно да го има - у-ците

a = sum((x - mean(x)) * (y - mean(y))) / sum((x - mean(x)) ** 2) # изчисляване на параметър, mean е средно аритметично
b = mean(y) - a * mean(x) # аналогично на a

print("a is ", a)
print("b is ", b)

model_x = linspace(-1, 1, 2) # абсцисна ос - от - 1 до 1
scatter(x, y) # изписване на точките
plot(model_x, model_x * a + b, 'r-', linewidth = 2) #  model_x * a + b е динамично сметната ординатна ос, за да влезнат всички точки в графиката
show()
